package com.example.alquran;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.example.alquran.amol.AdapterAmol;
import com.example.alquran.amol.ModelAmol;
import com.example.alquran.dua.AdapterDua;
import com.example.alquran.dua.ModelDua;

import java.util.ArrayList;
import java.util.List;

public class AmolActivity extends AppCompatActivity {

    RecyclerView recyclerView;
    LinearLayoutManager layoutManager;
    List<ModelAmol> amollist;
    AdapterAmol adapter;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_amol);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        getSupportActionBar().setTitle("সহিহ আমল সমূহ");

        initData();
        initRecyclerView();
    }

    private void initData() {

        amollist = new ArrayList<>();
        amollist.add(new ModelAmol("(১) ওজুর পরে কালিমা শাহাদাৎ পড়া", "প্রত্যেক ওযুর পর কালেমা শাহাদত পাঠ করুণ (আশ্হাদু আল্লা-ইলাহা ইল্লাল্লাহু ওয়াহ্দাহু লা- শারী কা লাহূ ওয়া আশহাদু আন্না মুহাম্মাদান ‘আব্দুহূ ওয়া রাসূলুহূ) । " +
                "এতে জান্নাতের ৮টি দরজার যে কোন দরজা দিয়ে প্রবেশ করতে পারবেন।", "সহিহ মুসলিম, হাদিস নং- ২৩৪।"));

        amollist.add(new ModelAmol("(২) বৃষ্টি বন্ধের জন্য", "পআনাস (রাঃ) বলেন, পরবর্তী জুম'আয় ঐ দরজা দিয়েই এক ব্যক্তি প্রবেশ করল রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম)-দাঁড়িয়ে খুৎবা দান রত অবস্থায়। " +
                "অতঃপর লোকটি রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) -এর দিকে মুখ করে দাঁড়িয়ে বলল, হে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম)! সম্পদ ধ্বংস হয়ে গেল এবং রাস্তা-ঘাট বন্ধ হয়ে গেল। আপনি আল্লাহর নিকট দু'আ করুন," +
                " আল্লাহ বৃষ্টি বন্ধ করে দিবেন। রাবী আনাস (রাঃ) বলেন, তখন রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) স্বীয় হস্তদ্বয় উত্তোলন পূর্বক বললেন, হে আল্লাহ! আমাদের নিকট থেকে বৃষ্টি সরিয়ে নিন, আমদের উপর বৃষ্টি বর্ষণ করবেন না। " +
                "হে আল্লাহ! অনাবাদী জমিতে, উঁচু জমিতে উপত্যকায় এবং ঘন বৃক্ষের উপর বৃষ্টি বর্ষণ করুন। ", "(বুখারী, ১ম খণ্ড, ১৩৭ পৃঃ; মুসলিম, ১ম খণ্ড, পৃঃ ২৯৩-২৯৪)"));

        amollist.add(new ModelAmol("(৩) চন্দ্র ও সূর্যগ্রহণের সময়",
                "আব্দুর রহমান ইবনু সামুরাহ (রাঃ) বলেন, আমি রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) -এর জীবদ্দশায় এক সময় তীর নিক্ষেপ করছিলাম। হঠাৎ দেখি সূর্যগ্রহণ লেগেছে। আমি তীরগুলো নিক্ষেপ করলাম এবং বললাম," +
                        " আজ সূর্যগ্রহণে রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) -এর অবস্থান লক্ষ্য করব। অতঃপর আমি তাঁর নিকট পৌছলাম। তিনি তখন দু'হাত উঠিয়ে প্রার্থনা করছিলেন এবং তিনি 'আল্লাহু আকবার', 'আল হামদুলিল্লাহ'," +
                        " 'লা ইলাহা ইল্লাল্ল-হ' বলছিলেন। শেষ পর্যন্ত সূর্য প্রকাশ হয়ে গেল। অতঃপর তিনি দু'টি সূরা পড়লেন এবং দু'রাকা'আত সলাত আদায় করলেন। ",
                "(মুসলিম ১ম খণ্ড, পৃঃ ২৯৯ হা/৯১৩, 'চন্দ্র ও সূর্য গ্রহণের ছালাত' অধ্যায়)"));

        amollist.add(new ModelAmol("(৪) উম্মাতের জন্য রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) -এর দু'আ",
                "আবদুল্লাহ ইবনু আমর ইবনু 'আস (রাঃ) বলেন, একদা রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) সূরা ইবরাহীমের ৩৫ নং আয়াত পাঠ করে দু'হাত উঠিয়ে বলেন, আমার উম্মাত, আমার উম্মাত এবং কাঁদতে থাকেন। তখন আল্লাহ তা'আলা বলেন," +
                        " হে জিবরীল! তুমি মুহাম্মাদের নিকট যাও এবং জিজ্ঞেস কর, কেন তিনি কাঁদেন। অতঃপর জিবরীল তাঁর নিকটে আগমন করে কাঁদার কারণ জানতে চাইলেন। তখন রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) তাঁকে বললেন, আল্লাহ তা'আলা তা অবগত। " +
                        "অতঃপর আল্লাহ তা'আলা জিবরীলকে বললেন, যাও, মুহাম্মাদকে বল যে, আমি তার উপর এবং তার উম্মতের উপর সন্তুষ্ট আছি। আমি তার অকল্যাণ করব না'।",
                "(মুসলিম, ১ম খণ্ড, পৃঃ ১১৩, হা/৩৪৬ 'ঈমান' অধ্যায়)"));

        amollist.add(new ModelAmol("(৫) কবর জিয়ারতের সময়",
                "আয়েশা (রাঃ) বলেন, একদা রাতে রসূল আমার নিকটে ছিলেন। শোয়ার সময় চাদর রাখলেন এবং জুতা খুলে পায়ের নিচে রেখে শুয়ে পড়লেন। তিনি অল্প সময় এ খেয়ালে থাকলেন যে," +
                        " আমি ঘুমিয়ে পড়েছি। অতঃপর ধীরে চাদর ও জুতা নিলেন এবং ধীরে দরজা খুলে বেরিয়ে পড়লেন এবং দরজা বন্ধ করে দিলেন। তখন আমিও কাপড় পরে চাদর মাথায় দিয়ে তাঁর পিছনে চললাম। তিনি \"বাক্বীউল গারক্বাদে\" (জান্নাতুল বাক্বী)" +
                        " পৌছলেন এবং দীর্ঘ সময় দাঁড়িয়ে থাকলেন। অতঃপর তিন তিন বার হাত উঠিয়ে প্রার্থনা করলেন। ",
                " (মুসলিম ১ম খণ্ড, পৃঃ ৩১৩, হা/৯৭৪ 'জানাযা' অধ্যায়, অনুচ্ছেদ-৩৫)"));

        amollist.add(new ModelAmol("(৭) হজ্জে পাথর নিক্ষেপের সময়",
                "আব্দুল্লাহ ইবনু ওমর (রাঃ) তিনটি জামারায় সাতটি পাথর খণ্ড নিক্ষেপ করতেন এবং প্রতিটি পাথর নিক্ষেপের সাথে তাকবীর বলতেন। প্রথম দু' জামারায় পাথর নিক্ষেপের পর ক্বিবলামুখী হয়ে দীর্ঘক্ষণ দাঁড়িয়ে দু'হাত তুলে দু'আ করতেন।" +
                        " তবে তৃতীয় জামারায় পাথর নিক্ষেপের পর দাঁড়াতেন না। শেষে বলতেন, আমি রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) -কে এগুলো এভাবেই পালন করতে দেখেছি'। ",
                " (বুখারী ১ম খণ্ড পৃঃ ২৩৬, হা/১৭৫১ 'হজ্জ' অধ্যায়)"));


        amollist.add(new ModelAmol("(৮) কোন গোত্রের জন্য দু'আ করা",
                "আবূ হুরায়রা (রাঃ) বলেন, একদা আবূ তুফাইল রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) এর কাছে গিয়ে বলল, হে আল্লাহর রসূল! দাঊস গোত্রও অবাধ্য ও অবশীভূত হয়ে গেছে, আপনি তাদের জন্য আল্লাহর কাছে বদ দু'আ করুন। " +
                        "তখন রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) ক্বিবলামুখী হ'লেন এবং দু'হাত তুলে বললেন, হে আল্লাহ! তুমি দাঊস গোত্রকে হেদায়াত দান কর এবং তাদেরকে সঠিক পথে নিয়ে আস'।",
                "(বুখারী, মুসলিম, ছহীহ আল আদাবুল মুফরাদ, পৃঃ ২০৯, হা/৬১১ সনদ ছহীহ)"));

        amollist.add(new ModelAmol("(৯) মুমিনকে কষ্ট বা গালি দেয়ার প্রতিকারে হাত তুলে দু'আ",
                "আয়েশা (রাঃ) রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) -কে হাত তুলে দু'আ করতে দেখেন। তিনি দু'আয় বলছিলেন, নিশ্চয়ই আমি মানুষ। কোন মুমিনকে গালি বা কষ্ট দিয়ে থাকলে তুমি আমাকে শাস্তি প্রদান কর না'।",
                "(ছহীহ আল-আদাবুল মুফরাদ, হা/৬১০, পৃঃ ২০৯; সিলসিলা ছহীহা, হা/৮২-৮৩ সনদ ছহীহ)"));


        amollist.add(new ModelAmol("(১০) রাতের বেলা সালাত আদায় করতে উঠলে মিস্\u200Cওয়াক করা",
                "হুযায়ফা (রাঃ) থেকে বর্ণিতঃ\n" + "\n" +
                        "তিনি বলেনঃ রাসূলুল্লাহ্\u200C (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) রাত্রিবেলা সালাত আদায় করতে উঠলে মিসওয়াক দ্বারা আপন দাঁত মাজতেন।",
                "সহিহ হাদিস"));


        amollist.add(new ModelAmol("", "", ""));
        amollist.add(new ModelAmol("", "", ""));
        amollist.add(new ModelAmol("", "", ""));
        amollist.add(new ModelAmol("", "", ""));
        amollist.add(new ModelAmol("", "", ""));
        amollist.add(new ModelAmol("", "", ""));
        amollist.add(new ModelAmol("", "", ""));
        amollist.add(new ModelAmol("", "", ""));

    }

    private void initRecyclerView() {

        recyclerView = findViewById(R.id.recyclerView);
        layoutManager = new LinearLayoutManager(this);
        layoutManager.setOrientation(RecyclerView.VERTICAL);
        recyclerView.setLayoutManager(layoutManager);
        adapter = new AdapterAmol(amollist);
        recyclerView.setAdapter(adapter);
        adapter.notifyDataSetChanged();
    }
}